xfire-sandbox/xfire-ws-security/src/test/org/codehaus/xfire/security/sample-wsse-request.xml

<soapenv:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soapenv:Header>
    <wsse:Security>
    <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
		<wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2006-01-10T19:16:26.953Z</wsu:Created>
		<wsu:Expires xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2006-01-13T19:16:29.953Z</wsu:Expires>
	</wsu:Timestamp>
      <wsse:UsernameToken>
        <wsse:Username>cupareq</wsse:Username>
        <wsse:Password>cupareq1</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <m:echo xmlns:m="urn:Echo"><m:text>Yo Yo</m:text></m:echo>
  </soapenv:Body>
</soapenv:Envelope>
